src/Enums/ТипыКонтрагентов/ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРожденияКлиента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолКлиента</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/HTTPServices/registerUser/Module.bsl
// HTTP-сервис "CustomerOrders"
// Предоставляет интерфейс для взаимодействия с мобильным приложением.
// В текущей версии реализована регистрация нового пользователя (клиента).

// Обработчик GET-запроса на регистрацию пользователя.
// Параметры строки запроса:
//   login – строка, желаемый логин (будет использован как имя пользователя ИБ и наименование в справочниках)
//   phone – строка, контактный телефон (сохраняется в карточке контрагента)
// Возвращает HTTP-ответ:
//   200 – регистрация успешна, в теле JSON с данными созданного пользователя
//   400 – не переданы обязательные параметры (login или phone)
//   409 – конфликт: пользователь с таким логином уже существует в справочнике или в ИБ
//   500 – внутренняя ошибка сервера (с описанием в теле ответа)
#Область ОбработчикиСобытий
Функция registerUserGET(Запрос)
    // 1. Извлечение параметров из строки запроса.
    // Каждый параметр получается как строка, обрезаются начальные и конечные пробелы.
    Логин = СокрЛП(Строка(Запрос.ПараметрыЗапроса.Получить("login")));
    Телефон = СокрЛП(Строка(Запрос.ПараметрыЗапроса.Получить("phone")));
    
    // Проверка обязательных полей. Если хотя бы одно не заполнено – возвращаем 400 (Bad Request).
    Если ПустаяСтрока(Логин) ИЛИ ПустаяСтрока(Телефон) Тогда
        Ответ = Новый HTTPСервисОтвет(400);
        Ответ.УстановитьТелоИзСтроки("Логин и телефон обязательны");
        Возврат Ответ;
    КонецЕсли;
    
    // 2. Проверка уникальности в справочнике "Пользователи".
    // Поиск по наименованию: логин должен быть уникальным в рамках прикладного справочника.
    СуществующийПользователь = Справочники.Пользователи.НайтиПоНаименованию(Логин);
    Если Не СуществующийПользователь.Пустая() Тогда
        Ответ = Новый HTTPСервисОтвет(409);
        Ответ.УстановитьТелоИзСтроки("Пользователь с таким логином уже существует");
        Возврат Ответ;
    КонецЕсли;   
    
    // 3. Проверка уникальности среди пользователей информационной базы.
    // Имя пользователя ИБ также должно быть уникальным – это требование платформы.
    Если ПользователиИнформационнойБазы.НайтиПоИмени(Логин) <> Неопределено Тогда
        Ответ = Новый HTTPСервисОтвет(409);
        Ответ.УстановитьТелоИзСтроки("Пользователь с таким логином уже существует в ИБ");
        Возврат Ответ;
    КонецЕсли;
    
    // Начало транзакции.
    // Все операции создания выполняются в одной транзакции, чтобы гарантировать
    // целостность данных: либо все объекты создаются, либо ни один.
    Попытка
        НачатьТранзакцию();
        
        // 4. Создание пользователя информационной базы.
        // Новый пользователь получает полные права – в учебном проекте для упрощения.
        // В реальной системе следует назначать ограниченную роль (например, "МобильныйКлиент").
        НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
        НовыйПользовательИБ.Имя = Логин;
        НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
        НовыйПользовательИБ.Записать();
        
        // 5. Создание карточки контрагента.
        // Клиент помещается в группу "Покупатели" для логической организации справочника.
        // Тип контрагента фиксируется как "Покупатель", в комментарии указывается канал регистрации.
        НовыйКлиент = Справочники.Контрагенты.СоздатьЭлемент();
        ПапкаКлиенты = Справочники.Контрагенты.НайтиПоНаименованию("Покупатели");
        НовыйКлиент.Родитель = ПапкаКлиенты;
        НовыйКлиент.Наименование = Логин; 
        НовыйКлиент.КонтактныйТелефон = Телефон;
        НовыйКлиент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Покупатель;
        НовыйКлиент.Комментарий = "Контрагент зарегистрирован через мобильное приложение";
        НовыйКлиент.Записать();
        
        // 6. Создание элемента справочника "Пользователи" и связывание с контрагентом.
        // Код элемента устанавливается равным уникальному идентификатору пользователя ИБ –
        // это обеспечивает однозначную связь между учётной записью и справочником.
        // Дополнительно сохраняется ссылка на созданного контрагента.
        НовыйПользовательСпр = Справочники.Пользователи.СоздатьЭлемент();
        НовыйПользовательСпр.Наименование = Логин;
        НовыйПользовательСпр.Код = НовыйПользовательИБ.УникальныйИдентификатор;
        НовыйПользовательСпр.СсылкаКлиент = НовыйКлиент.Ссылка;
        НовыйПользовательСпр.Записать();
        
        // Фиксация транзакции – все изменения вступают в силу.
        ЗафиксироватьТранзакцию();
        
        // 7. Формирование успешного ответа.
        // В теле ответа возвращается JSON с информацией о созданном пользователе:
        //   status  – "ok"
        //   message – текстовое описание результата
        //   name    – логин пользователя
        //   code    – строковое представление уникального идентификатора (для отладки)
        //   guid    – строковое представление ссылки на элемент справочника
        Ответ = Новый HTTPСервисОтвет(200);
        Результат = Новый Структура;
        Результат.Вставить("status", "ok");
        Результат.Вставить("message", "Пользователь успешно зарегистрирован");
        Результат.Вставить("name", Логин);
        Результат.Вставить("code", Строка(НовыйПользовательСпр.Код));
        Результат.Вставить("guid", Строка(НовыйПользовательСпр.Ссылка));    
        ЗаписьJSON = Новый ЗаписьJSON;
        ЗаписьJSON.УстановитьСтроку();
        ЗаписатьJSON(ЗаписьJSON, Результат);
        СтрокаОтвета = ЗаписьJSON.Закрыть();
        Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
        Возврат Ответ;
        
    Исключение
        // В случае любой ошибки откатываем все изменения, чтобы база осталась в согласованном состоянии.
        ОтменитьТранзакцию();
        Ответ = Новый HTTPСервисОтвет(500);
        Ответ.УстановитьТелоИзСтроки("Ошибка при регистрации: " + ОписаниеОшибки());
        Возврат Ответ;
    КонецПопытки;
КонецФункции
#КонецОбласти
